<img src="../images/cads-logo.png" width=200 align=left>
<img src="../images/python-logo.png" width=200 align=right>

In [1]:
#!conda install pandas
# pd is universal abbreviation of pandas
import pandas as pd
from IPython.display import display # utk jupyter je
# utk display better view of dataframe

In [2]:
import numpy as np

# Pandas
- [Pandas](#Pandas)
- [Introduction to Pandas](#Introduction-to-Pandas)
- [Series](#Series)
    - [Initializing Series](#Initializing-Series)
    - [Selecting Elements](#Selecting-Elements)
        - [loc](#loc)
        - [iloc](#iloc)
    - [Combining Series](#Combining-Series)
    - [Exercises](#Exercises)
        - [Exercise 1](#Exercise-1)
        - [Exercise 2](#Exercise-2)
        - [Exercise 3](#Exercise-3)
- [DataFrames](#DataFrames)
    - [Creating DataFrames](#Creating-DataFrames)
        - [Series as Rows](#Series-as-Rows)
        - [Series as Columns](#Series-as-Columns)
        - [Summary](#Summary)
    - [Pandas Pretty Print in Jupyter](#Pandas-Pretty-Print-in-Jupyter)
    - [Importing and Exporting Data](#Importing-and-Exporting-Data)
        - [Reading CSV](#Reading-CSV)
        - [Writing CSV](#Writing-CSV)
    - [Selecting Data](#Selecting-Data)
    - [Exercises](#Exercises)
        - [Exercise 1](#Exercise-1)
        - [Exercise 2](#Exercise-2)
        - [Exercise 3](#Exercise-3)
        - [Exercise 4](#Exercise-4)
- [Data Processing](#Data-Processing)
    - [Aggregation](#Aggregation)
    - [Arithmetic](#Arithmetic)
    - [Grouping](#Grouping)
    - [Unique and Duplicate Values](#Unique-and-Duplicate-Values)
        - [unique](#unique)
        - [duplicate](#duplicate)
    - [Exercises](#Exercises)
        - [Exercise 1](#Exercise-1)
        - [Exercise 2](#Exercise-2)
        - [Exercise 3](#Exercise-3)
        - [Exercise 4](#Exercise-4)
- [Merge Data Frames](#Merge-Data-Frames)
    - [Exercises](#Exercises)
        - [Exercise 1](#Exercise-1)
- [Reshaping Data Frames](#Reshaping-Data-Frames)
- [Exploratory Data Analysis](#Exploratory-Data-Analysis)
    - [Exercise 1](#Exercise-1)
    - [Exercise 2](#Exercise-2)
    - [Exercise 3](#Exercise-3)
    - [Exercise 4](#Exercise-4)
        - [Stacking and Unstacking Data Frames](#Stacking-and-Unstacking-Data-Frames)
    - [Exercise 5](#Exercise-5)
    - [Exercise 6](#Exercise-6)

## Introduction to Pandas

[Pandas](http://pandas.pydata.org/) is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. Pandas is free software released under the three-clause BSD license. The name is derived from the term _panel data_, an econometrics term for multidimensional structured data sets.

At it's core, Pandas consists of NumPy arrays and additional functions to perform typical data analysis tasks.

**Resources**:  
* [Pandas Documentation](http://pandas.pydata.org/pandas-docs/stable/index.html), especially
[10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
* [Hernan Rojas' learn-pandas](https://bitbucket.org/hrojas/learn-pandas)  
* [Harvard CS109 lab1 content](https://github.com/cs109/2015lab1)

## Series
Series form the basis of Pandas. They are essentially Python dictionaries with some added bells and whistles. However, Pandas Series 'keys' are called indices.

Series is label data. Use the index as label

### Initializing Series - 1D Data Structure
Series can be initialized from Python objects like lists or tuples. If only values are given, Pandas generates default indices.

Series are homogenous array (all elements need to have the same datatype) of immutable size (cannot add new item to series after you define it.)
Series similar to `column` in Excel.

Element can be accessed using index. We can define series from lists, tuples and dictionary.

In [3]:
animals = ['Tiger', 'Bear', 'Moose'] #List of strings
pd.Series(animals) # define lits as series 
# output in form of index - value

0    Tiger
1     Bear
2    Moose
dtype: object

In [4]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

Series can be mixed type

In [5]:
# Create a mixed series
mixed = [1, 2, "Three"]
print(pd.Series(mixed)) # kalau nak ada mixed datatype
# Type of series --> object (considered semua item tu string)
print()
print(type(mixed[0]))
print(type(mixed[1]))
print(type(mixed[2]))

0        1
1        2
2    Three
dtype: object

<class 'int'>
<class 'int'>
<class 'str'>

Series also support missing values via the `None` type.

In [6]:
#create a pandas series with None
#observe the dtype
animals = ['Tiger', 'Bear', None]
print(pd.Series(animals))
print("")
print(type(animals[0]))
print(type(animals[1]))
print(type(animals[2]))

0    Tiger
1     Bear
2     None
dtype: object

<class 'str'>
<class 'str'>
<class 'NoneType'>

In [7]:
numbers = [1, 2, None]
print(pd.Series(numbers))
print("")
print(type(numbers[0]))
print(type(numbers[1]))
print(type(numbers[2]))

0    1.0
1    2.0
2    NaN
dtype: float64

<class 'int'>
<class 'int'>
<class 'NoneType'>

We can define custom keys during initialization.

In [9]:
# create pandas series from list
sports = pd.Series(
    data=["Bhutan", "Scotland", "Japan", "South Korea"], 
    index=["Archery", "Golf", "Sumo", "Taekwondo"]) 
    # assign index utk label
print(sports)

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

Alternatively, Series can also be initialized with dictionaries. Indices are then generated from the dictionary keys.

In [10]:
#create a pandas series from dictionary
# x payah define index utk label
sports = pd.Series({
    'Archery': 'Bhutan',
    'Golf': 'Scotland',
    'Sumo': 'Japan',
    'Taekwondo': 'South Korea'})
print(sports)

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

We can list values and indices of series.

In [11]:
print(sports.index)
print(sports.values)

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')
['Bhutan' 'Scotland' 'Japan' 'South Korea']

Series type

In [ ]:
type(sports)

### Selecting Elements
As a result of iterative development of the Pandas library, there are several ways to select elements of a Series. Most of them are considered "legacy", however, and the best practice is to use `*.loc[...]` and `*.iloc[...]`. Take care to use the square brackets with `loc` and `iloc`, *not* the regular brackets as you would with functions.

#### loc
Select elements by their indices. If the index is invalid, either a `TypeError` or a `KeyError` will be thrown.

In [16]:
print(sports.loc['Golf']) # bagitau index dia utk dpt value
# mcm pakai column name utk cari value dalam column tu

Scotland

#### iloc
Select elements by their numerical IDs, i.e. the n-th element.

In [43]:
print(sports.iloc[1]) # cari value pakai index number

Scotland

In [17]:
print(sports.iloc[1:]) # cari value pakai index number

Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

If the indices were autogenerated then both loc and iloc seem to be identical.

In [19]:
sports_noindex = pd.Series(sports.values)
print(sports_noindex)
print("")
print(sports_noindex.loc[0]) # ni sbb index dia xde label
# sbb tu pakai nombor
print(sports_noindex.iloc[0])

0         Bhutan
1       Scotland
2          Japan
3    South Korea
dtype: object

Bhutan
Bhutan

In [23]:
print(sports_noindex_sorted.loc[2])

Japan

Take care to keep your code semantically correct, however. For example, if the series is resorted, the index of each element stays the same, but the ID changes!

In [21]:
sports_noindex_sorted = sports_noindex.sort_values()
print(sports_noindex_sorted) # sort ikut alphabet
print("") # index pon sorted jugak
print(sports_noindex_sorted.loc[1]) # loc ikut index
print(sports_noindex_sorted.iloc[1]) # iloc ikut value

0         Bhutan
2          Japan
1       Scotland
3    South Korea
dtype: object

Scotland
Japan

In [24]:
sports_noindex_sorted.reset_index() 
# reset sorting tapi still include index lama

   index            0
0      0       Bhutan
1      2        Japan
2      1     Scotland
3      3  South Korea

In [25]:
sport_2 = sports_noindex_sorted.reset_index(drop=True) 
#drop index lama
# store dekat variable baru so that dia jadi permanent

0         Bhutan
1          Japan
2       Scotland
3    South Korea
dtype: object

If you want to select by index then use `loc`, if you want to select by ID then use `iloc`. Do not use them interchangeably just because they return the same results right now. This will eventually lead to bugs in your code.

### Combining Series
Series can be combined by `appending` one to another

In [28]:
s1 = pd.Series(["A", "B", "C"])
s2 = pd.Series(["D", "E", "F"])
print(s1)
print("")
print(s2)
print("")

s3 = s1.append(s2) # lps append tu reset index

print(s3)

0    A
1    B
2    C
dtype: object

0    D
1    E
2    F
dtype: object

0    A
1    B
2    C
0    D
1    E
2    F
dtype: object

C:\Users\Acer\AppData\Local\Temp\ipykernel_4716\3045428719.py:8: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s3 = s1.append(s2) # dah outdate

Notice the duplicate indices! Pandas permits this and selecting by `loc` will return *both* entries

In [29]:
print(s3.loc[0])
print("")
print(s3.iloc[0])

0    A
0    D
dtype: object

A

Also notice that if your selection of a Series results in a single entry, Pandas automatically converts it to its base type, i.e. a string in this case. If the selection consists of more than 1 entry, however, a Series is returned.

In [30]:
print(s3.loc[0])
print(type(s3.loc[0])) # bila output kluar more than 1 element 
# datatype --> series
print("")
print(s3.iloc[0])
print(type(s3.iloc[0]))  # bila output kluar 1 element 
# datatype --> datatype element

0    A
0    D
dtype: object
<class 'pandas.core.series.Series'>

A
<class 'str'>

In [31]:
s3 = s1.append(s2)
s4 = s3.reset_index(drop = True)
s4

C:\Users\Acer\AppData\Local\Temp\ipykernel_4716\3828474086.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s3 = s1.append(s2)

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

In [32]:
print(s4.loc[0])
print("")
print(s4.iloc[0]) # dah xde repeating index

A

A

Series --> size immutable (x boleh tambah index baru) ; values mutable (boleh tukar value) --> `exeption` : boleh tukar pakai `loc`

In [34]:
s4.loc[0] = 'M'
s4

0    M
1    B
2    C
3    D
4    E
5    F
dtype: object

### Exercises

#### Exercise 1
Create a pandas Series object from the following movie ratings
    
    The Avengers: 9.2
    Mr. Bean: 7.4
    Garfield: 2.1
    Star Wars The Force Awakens: 8.8

In [35]:
# Haseena
movies = pd.Series({
    'The Avengers': 9.2,
    'Mr. Bean': 7.4,
    'Garfield': 2.1,
    'Star Wars The Force Awakens': 8.8})
movies

The Avengers                   9.2
Mr. Bean                       7.4
Garfield                       2.1
Star Wars The Force Awakens    8.8
dtype: float64

#### Exercise 2
Select the rating for the movie 'Garfield'.

In [ ]:
### Your code here

In [36]:
movies['Garfield']

2.1

In [42]:
movies.loc['Garfield']

2.1

#### Exercise 3
Select the index of the 2$^{nd}$ entry

In [ ]:
### Your code here

In [44]:
print(movies.index[1])

Mr. Bean

## DataFrames - 2D Array

Every column in dataframe can have different datatype. Similar to spreadsheeet (table object) in Excel. Size is mutable.

Multiple series with common indices can form a data frame. A data frame is like a table, with rows and columns (e.g., as in SQL or Excel).

|  .   | Animal | Capital |
| --- | --- | --- |
| India | a | b |
| Sweden | a | b |

Each row usually denotes an entry in our data and each column a feature we're interested in.

### Creating DataFrames

#### Series as Rows
Data frames can be created by glueing together Series objects as rows. In this case, the series indices become the data frame columns

In [2]:
import pandas as pd
row1 = pd.Series(("Elephant", "New Delhi"), index=("Animal", "Capital"))
row2 = pd.Series(("Reindeer", "Stockholm"), index=("Animal", "Capital"))
print(row1)
print()
print(row2)

Animal      Elephant
Capital    New Delhi
dtype: object

Animal      Reindeer
Capital    Stockholm
dtype: object

In [3]:
df = pd.DataFrame(data=[row1, row2], index=("India", "Sweden"))
df # define series as dataframe
# one row for one observation

          Animal    Capital
India   Elephant  New Delhi
Sweden  Reindeer  Stockholm

As before, we can make use of Pandas' flexibility and replace the Series objects with a dictionary

In [4]:
# directly buat dataframe from dictionary
df = pd.DataFrame(
    data=[
        {"Animal": "Elephant", "Capital": "New Delhi"},
        {"Animal": "Reindeer", "Capital": "Stockholm"}], #columns
    index=("India", "Sweden")) # letak label dekat index
df

          Animal    Capital
India   Elephant  New Delhi
Sweden  Reindeer  Stockholm

Or even a list of lists

In [5]:
df = pd.DataFrame(
    data=[["Elephant", "New Delhi"], 
          ["Reindeer", "Stockholm"]],
    index=["India", "Sweden"],
    columns=["Animal", "Capital"])
df

          Animal    Capital
India   Elephant  New Delhi
Sweden  Reindeer  Stockholm

Make sure to match indices and columns when combining series. Pandas won't necessarily raise an error but perform flexible merging.

In [6]:
row1 = pd.Series(("Elephant", "New Delhi"), index=("Animal", "City"))
row2 = pd.Series(("Reindeer", "Stockholm"), index=("Animal", "Capital")) # index utk series
print(row1)
print()
print(row2)
df = pd.DataFrame(data=[row1, row2], index=("India", "Sweden")) # index utk dataframe
display(df)

Animal     Elephant
City      New Delhi
dtype: object

Animal      Reindeer
Capital    Stockholm
dtype: object

          Animal       City    Capital
India   Elephant  New Delhi        NaN
Sweden  Reindeer        NaN  Stockholm

#### Series as Columns
We can also create data frames column-wise

In [ ]:
col1 = pd.Series(("Elephant", "New Delhi"), index=("Animal", "City"))
col2 = pd.Series(("Reindeer", "Stockholm"), index=("Animal", "Capital")) # index utk series
print(col1)
print()
print(col2)
df = pd.DataFrame(data=[col1, col2], index=("India", "Sweden")) # index utk dataframe
display(df)

In [7]:
col1 = pd.Series(["Elephant", "Reindeer"])
col2 = pd.Series(["New Delhi", "Stockholm"])
print(col1)
print()
print(col2)

0    Elephant
1    Reindeer
dtype: object

0    New Delhi
1    Stockholm
dtype: object

In [8]:
df = pd.DataFrame(data=[col1, col2],
                columns = ["Animal", "Capital" ],
                index = ["India", "Sweden"])
df

        Animal  Capital
India      NaN      NaN
Sweden     NaN      NaN

In [11]:
df = pd.DataFrame(data={'Animal':col1,'Capital':col2})
df

     Animal    Capital
0  Elephant  New Delhi
1  Reindeer  Stockholm

#### Summary
Series are pasted together to become data frames. They can be pasted as:
- rows: `data=[series1, series2, ...]`
- columns: `data=[series1, series2, ...]`

We can use the same `*.index` and `*.values` attributes as for Series

In [ ]:
print(df.index)
print(df.columns)
print(df.values)

### Pandas Pretty Print in Jupyter
Jupyter has a 'pretty print' option for Pandas dataframes. Using `print` will print the dataframes in Jupyter as they would appear in a standard console. But leaving it away or using IPython's `display` function will render them as HTML tables

In [12]:
print(df)

     Animal    Capital
0  Elephant  New Delhi
1  Reindeer  Stockholm

In [13]:
from IPython.display import display
display(df) # just for visualization

     Animal    Capital
0  Elephant  New Delhi
1  Reindeer  Stockholm

Jupyter allows a shortcut for the `display` function. If we execute a Python command or line of code that results in a data frame, Jupyter will assume we want to display it and do so using its built-in function. Note, however, that it will only ever do this with the last relevant line in each cell.

In [14]:
df # by default, Jupyter assume kita nak display

     Animal    Capital
0  Elephant  New Delhi
1  Reindeer  Stockholm

### Importing and Exporting Data
Most often we don't create data within our code but read it from external sources. Pandas has a large collection of importing (and corresponding exporting) functions available.

| Data | Reader | Writer |
| --- | --- | --- |
| CSV | `read_csv` | `to_csv` |
| JSON | `read_json` | `to_json` |
| HTML | `read_html` | `to_html` |
| Local clipboard | `read_clipboard` | `to_clipboard` |
| Excel | `read_excel` | `to_excel` |
| HDF5 | `read_hdf` | `to_hdf` |
| Feather | `read_feather` | `to_feather` |
| Parquet | `read_parquet` | `to_parquet` |
| Msgpack | `read_msgpack` | `to_msgpack` |
| Stata | `read_stata` | `to_stata` |
| SAS | `read_sas` |  |
| Python Picke Format | `read_pickle` | `to_pickle` |
| SQL | `read_sql` | `to_sql` |
| Google Big Query | `read_gbq` | `to_gbq` |

http://pandas.pydata.org/pandas-docs/stable/io.html

#### Reading CSV
We will read a tabular CSV file as an example.

In [15]:
cars = pd.read_csv("../data/cars.csv") #double dot = go back 2 times
cars

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
5,Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
6,Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
7,Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
8,Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
9,Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
10,Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
11,Merc 450SE,16.4,8,275.8,180,3.07,4.070,17.40,0,0,3,3
12,Merc 450SL,17.3,8,275.8,180,3.07,3.730,17.60,0,0,3,3
13,Merc 450SLC,15.2,8,275.8,180,3.07,3.780,18.00,0,0,3,3
14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
15,Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
16,Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
17,Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
18,Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
19,Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
20,Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
21,Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2
22,AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
23,Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
24,Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
25,Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2

In [16]:
%pwd #current working directory

'C:\\Users\\Acer\\Desktop\\Data Analytics\\Python for Analytics (Advance)\\Python for Analytics (Advanced)\\Day 5'

We can also define one of the columns as an index column using either the column header (if it exists) or the column ID (remember, Python starts counting at 0)

In [17]:
# assign a column name to be the index
cars = pd.read_csv("../data/cars.csv", index_col="model")

# Use head() to print only the first few lines
cars.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
model,,,,,,,,,,,
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [18]:
# assign column numbers as index
cars = pd.read_csv("../data/cars.csv", index_col=0)
cars.head(3) # by default bagi first 5 rows

                mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
model
Mazda RX4      21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
Datsun 710     22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1

In [19]:
cars.tail() # give last 5 rows in the dataframe

                 mpg  cyl   disp   hp  drat     wt  qsec  vs  am  gear  carb
model
Lotus Europa    30.4    4   95.1  113  3.77  1.513  16.9   1   1     5     2
Ford Pantera L  15.8    8  351.0  264  4.22  3.170  14.5   0   1     5     4
Ferrari Dino    19.7    6  145.0  175  3.62  2.770  15.5   0   1     5     6
Maserati Bora   15.0    8  301.0  335  3.54  3.570  14.6   0   1     5     8
Volvo 142E      21.4    4  121.0  109  4.11  2.780  18.6   1   1     4     2

In [26]:
cars.info() # show number of columns and rows

<class 'pandas.core.frame.DataFrame'>
Index: 32 entries, Mazda RX4 to Volvo 142E
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     32 non-null     float64
 1   cyl     32 non-null     int64
 2   disp    32 non-null     float64
 3   hp      32 non-null     int64
 4   drat    32 non-null     float64
 5   wt      32 non-null     float64
 6   qsec    32 non-null     float64
 7   vs      32 non-null     int64
 8   am      32 non-null     int64
 9   gear    32 non-null     int64
 10  carb    32 non-null     int64
dtypes: float64(5), int64(6)
memory usage: 3.0+ KB

#### Writing CSV
Writing CSV files is as straightforward as it gets. Notice that these functions are now methods of the specific objects, not of base Pandas

In [22]:
#!ls
# For windows:
!dir # my current directory

 Volume in drive C has no label.
 Volume Serial Number is EA3D-EA9B

 Directory of C:\Users\Acer\Desktop\Data Analytics\Python for Analytics (Advance)\Python for Analytics (Advanced)\Day 5

16/08/2022  11:01 AM    <DIR>          .
16/08/2022  11:01 AM    <DIR>          ..
16/08/2022  09:07 AM    <DIR>          .ipynb_checkpoints
16/08/2022  11:01 AM           119,203 Python_Day5_SC.ipynb
               1 File(s)        119,203 bytes
               3 Dir(s)  387,910,135,808 bytes free

In [23]:
cars.to_csv("cars2.csv") # write dataframe into a csv file

In [25]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is EA3D-EA9B

 Directory of C:\Users\Acer\Desktop\Data Analytics\Python for Analytics (Advance)\Python for Analytics (Advanced)\Day 5

16/08/2022  11:04 AM    <DIR>          .
16/08/2022  11:04 AM    <DIR>          ..
16/08/2022  09:07 AM    <DIR>          .ipynb_checkpoints
16/08/2022  11:04 AM             1,785 cars2.csv
16/08/2022  11:03 AM           119,909 Python_Day5_SC.ipynb
               2 File(s)        121,694 bytes
               3 Dir(s)  387,914,207,232 bytes free

### Selecting Data
Selecting data from Pandas arrays works just as it did for NumPy arrays, except that `loc` and `iloc` are necessary.

In [27]:
cars.head(10)
# each row are series

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
model,,,,,,,,,,,
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4

In [28]:
cars.iloc[9] # bagi information on the specific row
# iloc --> based on position 9 of item

mpg      19.20
cyl       6.00
disp    167.60
hp      123.00
drat      3.92
wt        3.44
qsec     18.30
vs        1.00
am        0.00
gear      4.00
carb      4.00
Name: Merc 280, dtype: float64

In [29]:
cars.iloc[9,:] # better pakai ni
# row 9, all columns

mpg      19.20
cyl       6.00
disp    167.60
hp      123.00
drat      3.92
wt        3.44
qsec     18.30
vs        1.00
am        0.00
gear      4.00
carb      4.00
Name: Merc 280, dtype: float64

In [30]:
cars.iloc[5, 3] # bagi value utk row 5, column 3

105

In [32]:
cars.iloc[4:7,:] # bagi information dari row 4 sampai row 6
# semua column

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
model,,,,,,,,,,,
Hornet Sportabout,18.7,8,360.0,175,3.15,3.44,17.02,0,0,3,2
Valiant,18.1,6,225.0,105,2.76,3.46,20.22,1,0,3,1
Duster 360,14.3,8,360.0,245,3.21,3.57,15.84,0,0,3,4

In [34]:
cars.iloc[1:9:2,:] # bagi information 1 sampai 9, skip 1 line

                 mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
model
Mazda RX4 Wag   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
Valiant         18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
Merc 240D       24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2

In [36]:
# nak tau pasal 'hp' je --> column 3
cars.iloc[1:9:2,3]

model
Mazda RX4 Wag     110
Hornet 4 Drive    110
Valiant           105
Merc 240D          62
Name: hp, dtype: int64

In [50]:
cars.iloc[3:7:,0:8:7] # nak mpg dgn vs je

                    mpg  vs
model
Hornet 4 Drive     21.4   1
Hornet Sportabout  18.7   0
Valiant            18.1   1
Duster 360         14.3   0

In [51]:
cars.loc['Hornet 4 Drive':'Duster 360',['mpg','vs']]

                    mpg  vs
model
Hornet 4 Drive     21.4   1
Hornet Sportabout  18.7   0
Valiant            18.1   1
Duster 360         14.3   0

In [ ]:
cars.iloc[1:9:2,2:]

As with Series, we can also select items by their index names.

In [39]:
cars.loc["Datsun 710",:]

mpg      22.80
cyl       4.00
disp    108.00
hp       93.00
drat      3.85
wt        2.32
qsec     18.61
vs        1.00
am        1.00
gear      4.00
carb      1.00
Name: Datsun 710, dtype: float64

In [41]:
cars.loc["Datsun 710",'cyl':'wt'] # row Datsun, column cyl until wt

cyl       4.00
disp    108.00
hp       93.00
drat      3.85
wt        2.32
Name: Datsun 710, dtype: float64

In [ ]:
cars.loc[["Datsun 710", "Ferrari Dino"]

In [42]:
# i want to select only cyl ,wt and  am
cars.loc[["Datsun 710", "Ferrari Dino"],['cyl','wt','am']]

              cyl    wt  am
model
Datsun 710      4  2.32   1
Ferrari Dino    6  2.77   1

Notice how a single entry is shown as a series but multiple entries as a data frame. This is analogous to how a single entry of a series is shown as a base type and multiple entries as a smaller series

<br><center><b>Base Type --> Series --> Data Frame</b></center>

Selecting columns can be done just as with dictionaries except that we can select multiple Pandas columns simultaneously. As with row selection, selecting a single column results in a Series object but selecting multiple columns results in a new DataFrame object.

In [52]:
cars["disp"] # tunjuk column 'disp' --> cars.loc[:, "disp"]
# output dpt series structure

model
Mazda RX4              160.0
Mazda RX4 Wag          160.0
Datsun 710             108.0
Hornet 4 Drive         258.0
Hornet Sportabout      360.0
Valiant                225.0
Duster 360             360.0
Merc 240D              146.7
Merc 230               140.8
Merc 280               167.6
Merc 280C              167.6
Merc 450SE             275.8
Merc 450SL             275.8
Merc 450SLC            275.8
Cadillac Fleetwood     472.0
Lincoln Continental    460.0
Chrysler Imperial      440.0
Fiat 128                78.7
Honda Civic             75.7
Toyota Corolla          71.1
Toyota Corona          120.1
Dodge Challenger       318.0
AMC Javelin            304.0
Camaro Z28             350.0
Pontiac Firebird       400.0
Fiat X1-9               79.0
Porsche 914-2          120.3
Lotus Europa            95.1
Ford Pantera L         351.0
Ferrari Dino           145.0
Maserati Bora          301.0
Volvo 142E             121.0
Name: disp, dtype: float64

In [53]:
cars[["disp", "wt"]].head()
# since 2 column, so dpt output dataframe

                    disp     wt
model
Mazda RX4          160.0  2.620
Mazda RX4 Wag      160.0  2.875
Datsun 710         108.0  2.320
Hornet 4 Drive     258.0  3.215
Hornet Sportabout  360.0  3.440

Alternatively, we can also use the `*.loc`/`.*iloc` syntax. In this case, we have to include both the row and column indices to select. As with base Python, the colon `:` instructs Pandas to select all rows or columns

In [ ]:
cars.loc[:, "disp"]

In [54]:
cars.disp # boleh cari satu column name je

model
Mazda RX4              160.0
Mazda RX4 Wag          160.0
Datsun 710             108.0
Hornet 4 Drive         258.0
Hornet Sportabout      360.0
Valiant                225.0
Duster 360             360.0
Merc 240D              146.7
Merc 230               140.8
Merc 280               167.6
Merc 280C              167.6
Merc 450SE             275.8
Merc 450SL             275.8
Merc 450SLC            275.8
Cadillac Fleetwood     472.0
Lincoln Continental    460.0
Chrysler Imperial      440.0
Fiat 128                78.7
Honda Civic             75.7
Toyota Corolla          71.1
Toyota Corona          120.1
Dodge Challenger       318.0
AMC Javelin            304.0
Camaro Z28             350.0
Pontiac Firebird       400.0
Fiat X1-9               79.0
Porsche 914-2          120.3
Lotus Europa            95.1
Ford Pantera L         351.0
Ferrari Dino           145.0
Maserati Bora          301.0
Volvo 142E             121.0
Name: disp, dtype: float64

In [55]:
cars.hp

model
Mazda RX4              110
Mazda RX4 Wag          110
Datsun 710              93
Hornet 4 Drive         110
Hornet Sportabout      175
Valiant                105
Duster 360             245
Merc 240D               62
Merc 230                95
Merc 280               123
Merc 280C              123
Merc 450SE             180
Merc 450SL             180
Merc 450SLC            180
Cadillac Fleetwood     205
Lincoln Continental    215
Chrysler Imperial      230
Fiat 128                66
Honda Civic             52
Toyota Corolla          65
Toyota Corona           97
Dodge Challenger       150
AMC Javelin            150
Camaro Z28             245
Pontiac Firebird       175
Fiat X1-9               66
Porsche 914-2           91
Lotus Europa           113
Ford Pantera L         264
Ferrari Dino           175
Maserati Bora          335
Volvo 142E             109
Name: hp, dtype: int64

In [ ]:
cars.loc["Mazda RX4", "disp"]

Take note that if we want to mix ID and index selection, we need to chain together `loc` and `iloc` calls. There is no way to combine this into a single index tuple.

In [58]:
print(cars.iloc[4])
print()
print(cars.iloc[4].loc["mpg"])

mpg      18.70
cyl       8.00
disp    360.00
hp      175.00
drat      3.15
wt        3.44
qsec     17.02
vs        0.00
am        0.00
gear      3.00
carb      2.00
Name: Hornet Sportabout, dtype: float64

18.7

In [ ]:
print(cars.loc[:, "mpg"])
print()
print(cars.loc[:, "mpg"].iloc[4])

We can see the names of all columns with the `columns` property (notice that this is also an index object, just as the row names is).

In [59]:
print(cars.columns) # all column name
print(cars.index) # all row name

Index(['mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear',
       'carb'],
      dtype='object')
Index(['Mazda RX4', 'Mazda RX4 Wag', 'Datsun 710', 'Hornet 4 Drive',
       'Hornet Sportabout', 'Valiant', 'Duster 360', 'Merc 240D', 'Merc 230',
       'Merc 280', 'Merc 280C', 'Merc 450SE', 'Merc 450SL', 'Merc 450SLC',
       'Cadillac Fleetwood', 'Lincoln Continental', 'Chrysler Imperial',
       'Fiat 128', 'Honda Civic', 'Toyota Corolla', 'Toyota Corona',
       'Dodge Challenger', 'AMC Javelin', 'Camaro Z28', 'Pontiac Firebird',
       'Fiat X1-9', 'Porsche 914-2', 'Lotus Europa', 'Ford Pantera L',
       'Ferrari Dino', 'Maserati Bora', 'Volvo 142E'],
      dtype='object', name='model')

In [ ]:
# tukar all column name
cars.columns = ['','']

In [ ]:
cars.columns.value[1] = 'CYL' #permanent change

In [63]:
# change single column name
# axis --> nak rename column ke row
cars.rename({'cyl':'CYL', 'wt':'WT'}, axis = 1 ) # TEMPORARY
# KALAU NAK PERMANENT KENA STORE DEKAT VARIABLE CARS

,mpg,CYL,disp,hp,drat,WT,qsec,vs,am,gear,carb
model,,,,,,,,,,,
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2
Valiant,18.1,6,225.0,105,2.76,3.460,20.22,1,0,3,1
Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
Merc 240D,24.4,4,146.7,62,3.69,3.190,20.00,1,0,4,2
Merc 230,22.8,4,140.8,95,3.92,3.150,22.90,1,0,4,2
Merc 280,19.2,6,167.6,123,3.92,3.440,18.30,1,0,4,4
Merc 280C,17.8,6,167.6,123,3.92,3.440,18.90,1,0,4,4
Merc 450SE,16.4,8,275.8,180,3.07,4.070,17.40,0,0,3,3
Merc 450SL,17.3,8,275.8,180,3.07,3.730,17.60,0,0,3,3
Merc 450SLC,15.2,8,275.8,180,3.07,3.780,18.00,0,0,3,3
Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
Fiat 128,32.4,4,78.7,66,4.08,2.200,19.47,1,1,4,1
Honda Civic,30.4,4,75.7,52,4.93,1.615,18.52,1,1,4,2
Toyota Corolla,33.9,4,71.1,65,4.22,1.835,19.90,1,1,4,1
Toyota Corona,21.5,4,120.1,97,3.70,2.465,20.01,1,0,3,1
Dodge Challenger,15.5,8,318.0,150,2.76,3.520,16.87,0,0,3,2
AMC Javelin,15.2,8,304.0,150,3.15,3.435,17.30,0,0,3,2
Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
Pontiac Firebird,19.2,8,400.0,175,3.08,3.845,17.05,0,0,3,2
Fiat X1-9,27.3,4,79.0,66,4.08,1.935,18.90,1,1,4,1
Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.70,0,1,5,2
Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.90,1,1,5,2
Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.50,0,1,5,6
Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8
Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.60,1,1,4,2

In [ ]:
# tukar all row names
cars.index = ['','']

We can also use boolean masks to select rows or columns, i.e.

```python
cars.loc[True, True, False, True, False, ...]
```

However, as we're dealing with large datasets, typing them out by hand is suboptimal. So let's use some simple boolean conditions instead.

In [64]:
# Pandas applies the operation to each individual entry
print(cars["mpg"] > 25)

model
Mazda RX4              False
Mazda RX4 Wag          False
Datsun 710             False
Hornet 4 Drive         False
Hornet Sportabout      False
Valiant                False
Duster 360             False
Merc 240D              False
Merc 230               False
Merc 280               False
Merc 280C              False
Merc 450SE             False
Merc 450SL             False
Merc 450SLC            False
Cadillac Fleetwood     False
Lincoln Continental    False
Chrysler Imperial      False
Fiat 128                True
Honda Civic             True
Toyota Corolla          True
Toyota Corona          False
Dodge Challenger       False
AMC Javelin            False
Camaro Z28             False
Pontiac Firebird       False
Fiat X1-9               True
Porsche 914-2           True
Lotus Europa            True
Ford Pantera L         False
Ferrari Dino           False
Maserati Bora          False
Volvo 142E             False
Name: mpg, dtype: bool

In [65]:
# Use loc, not iloc, to select based on boolean masks
cars.loc[cars["mpg"] > 25]
# only rows yg ada mpg > 25 je yg kluar

                 mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
model
Fiat 128        32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
Honda Civic     30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
Toyota Corolla  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
Fiat X1-9       27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
Porsche 914-2   26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
Lotus Europa    30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2

In [67]:
# cars with hp > 200
cars.loc[cars["hp"] > 200]

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
model,,,,,,,,,,,
Duster 360,14.3,8,360.0,245,3.21,3.570,15.84,0,0,3,4
Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4
Chrysler Imperial,14.7,8,440.0,230,3.23,5.345,17.42,0,0,3,4
Camaro Z28,13.3,8,350.0,245,3.73,3.840,15.41,0,0,3,4
Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.50,0,1,5,4
Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.60,0,1,5,8

We can also select specific rows of certain columns with boolean masks.

In [69]:
# which cars have hp > 200
cars.loc[cars["hp"] > 200].index

Index(['Duster 360', 'Cadillac Fleetwood', 'Lincoln Continental',
       'Chrysler Imperial', 'Camaro Z28', 'Ford Pantera L', 'Maserati Bora'],
      dtype='object', name='model')

In [70]:
cars.loc[cars["hp"] > 200].index.tolist() # dalam bentuk list

['Duster 360',
 'Cadillac Fleetwood',
 'Lincoln Continental',
 'Chrysler Imperial',
 'Camaro Z28',
 'Ford Pantera L',
 'Maserati Bora']

In [73]:
# cars with hp > 200, how many carburator they have?
cars2 = cars.loc[cars["hp"] > 200, ["carb"]]
cars2

                     carb
model
Duster 360              4
Cadillac Fleetwood      4
Lincoln Continental     4
Chrysler Imperial       4
Camaro Z28              4
Ford Pantera L          4
Maserati Bora           8

In [78]:
# nak cari unique value utk carb ni
print(cars.loc[cars["hp"] > 200] ["carb"].unique())
# nak tau ada brapa item
print(cars.loc[cars["hp"] > 200] ["carb"].nunique())
print(len(cars.loc[cars["hp"] > 200] ["carb"].unique()))

[4 8]
2
2

In [81]:
cars.loc[cars['mpg']>25]

                 mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
model
Fiat 128        32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
Honda Civic     30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
Toyota Corolla  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
Fiat X1-9       27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
Porsche 914-2   26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
Lotus Europa    30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2

In [82]:
cars.loc[cars['mpg']>25, 'hp']

model
Fiat 128           66
Honda Civic        52
Toyota Corolla     65
Fiat X1-9          66
Porsche 914-2      91
Lotus Europa      113
Name: hp, dtype: int64

In [80]:
# cars with mpg > 25, give their hp and disp
cars.loc[cars["mpg"] > 25, ["hp", "disp"]] # more than 1 column

                 hp   disp
model
Fiat 128         66   78.7
Honda Civic      52   75.7
Toyota Corolla   65   71.1
Fiat X1-9        66   79.0
Porsche 914-2    91  120.3
Lotus Europa    113   95.1

In [79]:
# unique value dekat whole data utk column [gear]
cars['gear'].unique()

array([4, 3, 5], dtype=int64)

### Exercises
Familiarize yourselves with data frame creation and handling.

#### Exercise 1
Manually create a dataframe from the following data. EmployeeID should be the index of the dataframe. Try using different methods (e.g. nested dictionaries, list of lists, series objects as rows or columns)

```
EmployeeID,EmployeeName,Salary,Department
2044,James,2500,Finance
1082,Hannah,4000,Sales
7386,Victoria,3700,IT
```

In [ ]:
### Your code here

#### Exercise 2
Read in the chocolate.csv data set and display the first 8 lines

In [86]:
choc = pd.read_csv('../data/chocolate.csv')
choc.head(8)

,Company,Bean Origin or Bar Name,REF,Review Date,Cocoa Percent,Company Location,Rating,Bean Type,Country of Origin
0,A. Morin,Agua Grande,1876,2016,63%,France,3.75,,Sao Tome
1,A. Morin,Kpime,1676,2015,70%,France,2.75,,Togo
2,A. Morin,Atsane,1676,2015,70%,France,3.00,,Togo
3,A. Morin,Akata,1680,2015,70%,France,3.50,,Togo
4,A. Morin,Quilla,1704,2015,70%,France,3.50,,Peru
5,A. Morin,Carenero,1315,2014,70%,France,2.75,Criollo,Venezuela
6,A. Morin,Cuba,1315,2014,70%,France,3.50,,Cuba
7,A. Morin,Sur del Lago,1315,2014,70%,France,3.50,Criollo,Venezuela

#### Exercise 3
Select only the chocolates with "Congo" as the country of origin and show only the rating, the cocoa percent, and the country of origin (to make sure we've selected the right products)

In [88]:
# Haseena
choc.loc[choc["Country of Origin"] == 'Congo', ["Rating", "Cocoa Percent",'Country of Origin']]

      Rating Cocoa Percent Country of Origin
136     3.75           72%             Congo
213     3.50           82%             Congo
308     3.50           70%             Congo
403     3.50           68%             Congo
1202    3.75           70%             Congo
1233    3.00           70%             Congo
1357    2.75           75%             Congo
1654    3.25           65%             Congo
1788    3.25           68%             Congo
1791    3.00           65%             Congo

In [ ]:
choc[]

#### Exercise 4
Oh no! There was a mistake in the data entry. One of the products has a missing country of origin. Please find it, replace it with "Venezuela", and save the fixed data frame as "chocolate_fixed.csv"

  - You can use `*.isna()` to identify which entry of a series is either `NaN` or `None`, e.g. `mySeries.isna()`
  - You can assign values to data frames just like you would to lists, e.g. `df.iloc[0, 5] = 15`

In [92]:
choc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1795 entries, 0 to 1794
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Company                  1795 non-null   object
 1   Bean Origin or Bar Name  1795 non-null   object
 2   REF                      1795 non-null   int64
 3   Review Date              1795 non-null   int64
 4   Cocoa Percent            1795 non-null   object
 5   Company Location         1795 non-null   object
 6   Rating                   1795 non-null   float64
 7   Bean Type                1794 non-null   object
 8   Country of Origin        1795 non-null   object
dtypes: float64(1), int64(2), object(6)
memory usage: 126.3+ KB

In [89]:
choc.loc[choc["Country of Origin"].isna()]
# identify row mana yg ada missing value

,Company,Bean Origin or Bar Name,REF,Review Date,Cocoa Percent,Company Location,Rating,Bean Type,Country of Origin
1072,Mast Brothers,Madagascar,999,2012,72%,U.S.A.,2.5,Trinitario,NaN

In [94]:
choc.loc[choc["Country of Origin"].isna(),'Country of Origin'] = 'Venezuela'
# ada x row yg  missing value dekat country origin = venezuela

In [93]:
# check number of missing value in dataframe
choc.isna().sum()

Company                    0
Bean Origin or Bar Name    0
REF                        0
Review Date                0
Cocoa Percent              0
Company Location           0
Rating                     0
Bean Type                  1
Country of Origin          0
dtype: int64

In [91]:
choc.iloc[1072,8] = 'Venezuela'
choc.iloc[1072,:]

Company                    Mast Brothers
Bean Origin or Bar Name       Madagascar
REF                                  999
Review Date                         2012
Cocoa Percent                        72%
Company Location                  U.S.A.
Rating                               2.5
Bean Type                     Trinitario
Country of Origin              Venezuela
Name: 1072, dtype: object

## Data Processing
Pandas contains many functions to process and transform data. These can be called either on data frames or individual series. Describing every function in detail is far too time-consuming and application-dependent. A thorough list and description of *all* Pandas functionality can be found here: https://pandas.pydata.org/pandas-docs/stable/api.html

Many of the functions are more or less self-explanatory and/or well-documented

### Aggregation

In [97]:
numbers = pd.Series([1, 2, 3, 4, 5, 5, 6, 6, 6])
print(numbers)
print()
print(numbers.sum())
print(numbers.mean())
print(numbers.max()) # give max value
print(numbers.min())
print(numbers.idxmax()) # give index of max value in the series
print(numbers.idxmin())

0    1
1    2
2    3
3    4
4    5
5    5
6    6
7    6
8    6
dtype: int64

38
4.222222222222222
6
1
6
0

In [98]:
print(numbers.idxmin()) # give index of max value in the series
print(numbers.argmin())

0
0

Functions can be applied to series or data.frames. In the case of data frames, they are applied to each row or column individually

In [99]:
df = pd.DataFrame([[1,1,1], [2,2,2], [3,3,3]])
df

   0  1  2
0  1  1  1
1  2  2  2
2  3  3  3

In [101]:
df.sum(axis = 0) # return sum of individual column

0    6
1    6
2    6
dtype: int64

In [106]:
df.sum(axis = 1) # return sum of individual row
df.sum(axis = 'columns') # same output

0    3
1    6
2    9
dtype: int64

In [103]:
df.idxmax() # give index of max value for every column
# max value at index 2

0    2
1    2
2    2
dtype: int64

In [104]:
df.mean() # give mean of every column --> by default column

0    2.0
1    2.0
2    2.0
dtype: float64

In [105]:
df.mean(axis = 'rows') # give mean of every row

0    1.0
1    2.0
2    3.0
dtype: float64

In [ ]:
df.mean(axis = 1) # give mean of every row

We can decide whether the aggregation should occur along columns or rows. Note however, that the syntax is confusing. `axis=X` indicates along which dimension the function will "travel". For example, `axis=columns` indicates that all columns will be collapsed into the function, and the function will be applied to individual rows. Likewise, `axis=rows` means that the function will travel along rows and compute the aggregate value for each column individually.

In [ ]:
df.sum(axis='columns')

In [ ]:
df.sum(axis='rows')

In [108]:
df

   0  1  2
0  1  1  1
1  2  2  2
2  3  3  3

The most important aggregation function is `*.apply()`, which applies an arbitrary function to each row/column.

In [110]:
# nak apply function ni dekat column/row
# df.apply(function)
df.apply(lambda x: sum(x**2), axis='columns') 
# lambda function --> squared of sum for each column

0     3
1    12
2    27
dtype: int64

`*.apply()` is slower than the built-in functions, so should not be used for simple operations that can also be solved with direct operations on data frames.

Kalau aggregation (min, max, avg, sum) better pakai aggregate terus.

In [111]:
df = pd.DataFrame([[1,1,1], [2,2,2], [3,3,3]])
# compare running time (apply vs aggregation)
%timeit df.apply(lambda x: sum(x**2))
%timeit (df**2).sum()

4.41 ms  779 s per loop (mean  std. dev. of 7 runs, 100 loops each)
2.29 ms  165 s per loop (mean  std. dev. of 7 runs, 100 loops each)

Also take care that the function will be applied to all columns, regardless of type. The built-in functions are clever enough to skip columns for which they are not defined.

In [116]:
df = pd.DataFrame({
    "Age": [10, 12, 12], 
    "Name": ["Liz", "John", "Sam"]})

display(df)
df.sum() # sum each column

# Uncomment for exception
df.apply(lambda x: sum(x**2), axis="rows")
# apply utk numerical je

   Age  Name
0   10   Liz
1   12  John
2   12   Sam

TypeError: unsupported operand type(s) for ** or pow(): 'str' and 'int'

### Arithmetic - make sure the elements are numerical
We can also perform element-wise operations on dataframe columns or rows, e.g.

In [117]:
df = pd.DataFrame(
    data=[[1,2,3], [4,5,6], [7,8,9]], 
    columns=["ColA", "ColB", "ColC"], 
    index=["RowA", "RowB", "RowC"])
df

      ColA  ColB  ColC
RowA     1     2     3
RowB     4     5     6
RowC     7     8     9

In [118]:
df["ColA"] + df["ColB"] # addition element by element
# use numpy broadcasting method

RowA     3
RowB     9
RowC    15
dtype: int64

In [119]:
# Pandas is smart enough to convert our list into a series and then add the two columns element-wise
df["ColA"] + [10, 11, 12]

RowA    11
RowB    15
RowC    19
Name: ColA, dtype: int64

In [120]:
# Remember, both rows AND columns can be represented as Pandas series
df.loc["RowA", :] * df.loc["RowB",:]

ColA     4
ColB    10
ColC    18
dtype: int64

Pandas adheres to the same broadcasting rules as NumPy

In [121]:
df = pd.DataFrame(
    data=[[1,2], [3,4], [5,6]], 
    columns=["ColA", "ColB"], 
    index=["RowA", "RowB", "RowC"])
df

      ColA  ColB
RowA     1     2
RowB     3     4
RowC     5     6

In [122]:
df * 2

      ColA  ColB
RowA     2     4
RowB     6     8
RowC    10    12

In [123]:
df * [1, -1] # colA will multiply 1, colB will multiply -1
# ikut broadcasting method

      ColA  ColB
RowA     1    -2
RowB     3    -4
RowC     5    -6

In [125]:
df.loc["RowA",:] / 5

ColA    0.2
ColB    0.4
Name: RowA, dtype: float64

In [129]:
df["ColB"] ** 3

RowA      8
RowB     64
RowC    216
Name: ColB, dtype: int64

### Grouping
A core functionality of Pandas is the `ability to group data frames and apply functions to each individual group`. The function `*.groupby(...)` defines groups based on common labels. Aggregators applied to this grouped data frame are then applied to each group individually.

In [3]:
import pandas as pd
df = pd.DataFrame({
    "Height": [178, 182, 158, 167, 177, 174, 175, 185], 
    "Age": [24, 33, 32, 18, 21, 28, 22, 29],
    "Gender": ["M", "M", "F", "F", "M", "F", "M", "F"]})
display(df)

   Height  Age Gender
0     178   24      M
1     182   33      M
2     158   32      F
3     167   18      F
4     177   21      M
5     174   28      F
6     175   22      M
7     185   29      F

In [132]:
# contoh: groupkan 'gender' jadi male, female
# boleh kira height female group dgn male group

# pandas x tunjuk groupby physically, dia just consider dah grouped
print(df.groupby("Gender")) # group ikut ada berapa unique value
display(df.groupby("Gender").mean()) # kena ada aggregation
display(df.groupby("Gender"))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002390B12B4F0>

        Height    Age
Gender
F        171.0  26.75
M        178.0  25.00

In [133]:
display(df.groupby("Gender").max()) # kena ada aggregation

        Height  Age
Gender
F          185   32
M          182   33

We can also select columns without disturbing the grouping

In [134]:
df.groupby("Gender")['Age'].max() 
# kalau nak buat utk 1 column je

Gender
F    32
M    33
Name: Age, dtype: int64

In [138]:
# nak buat more than 1 aggregation
import numpy as np
df.groupby("Gender")['Age'].agg([np.min,np.max,np.mean])
# np.count , np.size x wujud

        amin  amax   mean
Gender
F         18    32  26.75
M         21    33  25.00

In [142]:
# count dgn size sama je
df.groupby("Gender")['Age'].agg(['min','max','mean','count','size'])

        min  max   mean  count  size
Gender
F        18   32  26.75      4     4
M        21   33  25.00      4     4

In [ ]:
# count

In [ ]:
display(df.groupby("Gender")["Height"].mean())

A useful function is `size()`, which counts how large each of the groups is.

In [1]:
df.groupby("Gender").size() # ada 4 male and 4 female

NameError: name 'df' is not defined

In [4]:
df.groupby("Gender")["Gender"].count() # kena specify column

Gender
F    4
M    4
Name: Gender, dtype: int64

### Unique and Duplicate Values
Two functions can help us identify unique and duplicate values within Series objects. They are aptly names `unique()` and `duplicated()`, respectively.

#### unique
`*.unique()` returns only unique values of a Series object.

In [144]:
s = pd.Series([1,2,3,2,3,4,3,5])
s.unique()

array([1, 2, 3, 4, 5], dtype=int64)

In [143]:
cars['cyl'].unique() # cari unique value dekat column tu

array([6, 4, 8], dtype=int64)

#### duplicate
`*.duplicated()` identifies duplicated values in Series objects and returns a boolean Series. Entries that have already been seen are marked as `True` while new values are marked as `False`.

In [145]:
s = pd.Series([1,2,3,2,3,4,3,5])
s.duplicated() # return boolean
# false = unique  true = duplicated(nombor ni dah ada tadi)

0    False
1    False
2    False
3     True
4     True
5    False
6     True
7    False
dtype: bool

When applied to Dataframes, `duplicated()` compares entire rows for duplicates.

In [146]:
df = pd.DataFrame([
    ["Dog", 5], 
    ["Cat", 4], 
    ["Dog", 5], 
    ["Fish", 2], 
    ["Cat", 8]], 
    columns=["Animal", "Age"])
display(df)
display(df.duplicated()) # check every row
# return True if row repeated

  Animal  Age
0    Dog    5
1    Cat    4
2    Dog    5
3   Fish    2
4    Cat    8

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [147]:
# show the repeated row
df.loc[df.duplicated()]

  Animal  Age
2    Dog    5

To remove duplicate rows from a data frame we could `drop_duplicates()` function.

In [148]:
df.drop_duplicates() # return output after remove duplicated row

  Animal  Age
0    Dog    5
1    Cat    4
3   Fish    2
4    Cat    8

In [ ]:
# save dekat variable yg sama
df.drop_duplicates(subset = 'Animal', inplace = True)

In [149]:
# nak buang duplicated item kat specific column
# contoh: nak buang duplication dekat column 'animal'
df1 = df.drop_duplicates(subset = 'Animal')
# kena save dekat variable baru jadi permanent

  Animal  Age
0    Dog    5
1    Cat    4
3   Fish    2

### Exercises

#### Exercise 1
Load the "cars.csv" dataframe and calculate the average miles per gallon (column "mpg")

In [152]:
cars['mpg'].mean()

20.090624999999996

In [151]:
cars.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
model,,,,,,,,,,,
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

#### Exercise 2
Cars can have 4, 6, or 8 cylinders (column "cyl"). Find the mean miles per gallon (column "mpg") for each of these classes **without** using the `groupby(...)` function.

*BONUS: Write a function that takes the number of cylinders and returns the mean miles per gallon.*

In [168]:
unique1 = cars['cyl'].unique()
list(unique1)

[6, 4, 8]

In [159]:
def f(x):
    return df['mpg'].mean()

In [169]:
f(unique1)

KeyError: 'mpg'

#### Exercise 3
Repeat the above exercise but this time make use of the `groupby(...)` function.

In [164]:
display(cars.groupby("cyl")['mpg'].mean())

cyl
4    26.663636
6    19.742857
8    15.100000
Name: mpg, dtype: float64

#### Exercise 4
Your client has a proprietary metric for car engine quality that is calculated as $Q = \frac{hp}{wt^2}$. Calculate this metric for all cars and then find the average for cars with a manual (column "am" == 1) or automatic (column "am" == 0) transmission.

**HINT** You can add the new metric as a column to your data frame via `cars["q_metric'] = ...`. Assignments to unknown column (or row) index names will result in new columns (or rows) to be appended to the data frame.

In [171]:
cars['q_metric'] = cars['hp']/cars['wt']**2
cars.head()

,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,q_metric
model,,,,,,,,,,,,
Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,16.024707
Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,13.308129
Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1,17.278537
Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1,10.642183
Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2,14.788399

In [173]:
# Haseena
cars['q_metric'] = cars['hp']/cars['wt']**2
display(cars.groupby("am")['q_metric'].mean())

am
0    11.490145
1    21.216699
Name: q_metric, dtype: float64

## Merge Data Frames
Pandas data frames can be treated like SQL tables and joined.

In [174]:
sales = pd.DataFrame({
    "Date": pd.date_range(start="2018-10-01", end="2018-10-07"), 
    "ItemID": ["A401", "C776", "A401", "FY554", "Y98R", "Y98R", "FY554"]})
sales

        Date ItemID
0 2018-10-01   A401
1 2018-10-02   C776
2 2018-10-03   A401
3 2018-10-04  FY554
4 2018-10-05   Y98R
5 2018-10-06   Y98R
6 2018-10-07  FY554

In [175]:
item_info = pd.DataFrame({
    "ID": ["A401", "C776", "FY554", "Y98R"],
    "Name": ["Toaster", "Vacuum Cleaner", "Washing Machine", "Clothes Iron"], 
    "Price": [25, 220, 540, 85]})
item_info

      ID             Name  Price
0   A401          Toaster     25
1   C776   Vacuum Cleaner    220
2  FY554  Washing Machine    540
3   Y98R     Clothes Iron     85

We can join Sales with Item Sales

In [176]:
# identify column apa yg sama utk dua table tu
# first (left) data.merge(the other data (right),how to join, column yg sama dkat left data, column yg sama dkat right data)
# by default--> dia inner join
sales.merge(right=item_info, how="inner", left_on="ItemID", right_on="ID")

        Date ItemID     ID             Name  Price
0 2018-10-01   A401   A401          Toaster     25
1 2018-10-03   A401   A401          Toaster     25
2 2018-10-02   C776   C776   Vacuum Cleaner    220
3 2018-10-04  FY554  FY554  Washing Machine    540
4 2018-10-07  FY554  FY554  Washing Machine    540
5 2018-10-05   Y98R   Y98R     Clothes Iron     85
6 2018-10-06   Y98R   Y98R     Clothes Iron     85

Merge types:
- **Inner**: keep only rows with corresponding IDs found in *both* data frames
- **Left**: use only rows with IDs found in the left data frame
--> amik semua dekat left, pastu joinkan kanan punya kalau ada yg match
- **Right**: use only rows with IDs found in the right data frame
--> amik semua dekat right, pastu joinkan kiri punya kalau ada yg match
- **Outer**: use all keys that are in at least one of the data frames. This is essentially the combination of left and right joins
--> join semua sekali, tapi x repeat

Missing data will be replaced by `NaN` values

In [177]:
sales = pd.DataFrame({
    "Date": pd.date_range(start="2018-10-01", end="2018-10-07"), 
    "ItemID": ["A401", "ZZZC776", "A401", "ZZZFY554", "Y98R", "Y98R", "FY554"]})
display(sales)
item_info = pd.DataFrame({
    "ID": ["A401", "C776", "FY554", "Y98R", "U1776"],
    "Name": ["Toaster", "Vacuum Cleaner", "Washing Machine", "Clothes Iron", "Computer"], 
    "Price": [25, 220, 540, 85, 899]})
display(item_info)

        Date    ItemID
0 2018-10-01      A401
1 2018-10-02   ZZZC776
2 2018-10-03      A401
3 2018-10-04  ZZZFY554
4 2018-10-05      Y98R
5 2018-10-06      Y98R
6 2018-10-07     FY554

      ID             Name  Price
0   A401          Toaster     25
1   C776   Vacuum Cleaner    220
2  FY554  Washing Machine    540
3   Y98R     Clothes Iron     85
4  U1776         Computer    899

In [ ]:
sales.merge(right=item_info, how="inner", left_on="ItemID", right_on="ID")

In [178]:
sales.merge(right=item_info, how="left", left_on="ItemID", right_on="ID")

        Date    ItemID     ID             Name  Price
0 2018-10-01      A401   A401          Toaster   25.0
1 2018-10-02   ZZZC776    NaN              NaN    NaN
2 2018-10-03      A401   A401          Toaster   25.0
3 2018-10-04  ZZZFY554    NaN              NaN    NaN
4 2018-10-05      Y98R   Y98R     Clothes Iron   85.0
5 2018-10-06      Y98R   Y98R     Clothes Iron   85.0
6 2018-10-07     FY554  FY554  Washing Machine  540.0

In [ ]:
sales.merge(right=item_info, how="right", left_on="ItemID", right_on="ID")

In [ ]:
sales.merge(right=item_info, how="outer", left_on="ItemID", right_on="ID")

We can also merge on indices, either of one or both of the data frames

In [179]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [ ]:
df1 = df1.set_index("employee")
df2 = df2.set_index("employee")
display(df1, df2)

In [ ]:
df1.merge(df2, left_index=True, right_index=True)
# nak join by index
# by default inner join

In [180]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df2 = df2.set_index("employee")
display(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [181]:
df1.merge(df2, left_on="employee", right_index=True)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

### Exercises

#### Exercise 1
Merge the three data frames so that we have all information available for Bob, Alice, Kevin, and Joshua in a single data frame

In [ ]:
salaries = pd.DataFrame(
    data=[["Bob", 5000], ["Alice", 4000], ["Kevin", 8000]], 
    columns=["Name", "Salary"])
departments = pd.DataFrame(
    data=[["Kevin", "IT"], ["Joshua", "Data Science"], ["Bob", "Data Science"]], 
    columns=["Name", "Department"])
supervisors = pd.DataFrame(
    data=[["IT", "Jeremy"], ["Data Science", "Darren"], ["Sales", "Yvonne"]], 
    columns=["Department", "Supervisor"])

In [ ]:
display(salaries, departments, supervisors)

## Reshaping Data Frames
In data analysis, we speak of 'tall' and 'wide' data formats when refering to the structure of a data frame. A 'wide' data frame lists each feature in a separate column, e.g.

| Name | Age | Hair Color |
| ---- | --- | ---------- |
| Joe  | 41  | Brown      |
| Carl | 32  | Blond      |
| Mike | 22  | Brown      |
| Sue  | 58  | Black      |
| Liz  | 27  | Blond      |

A 'tall' data frame, on the other hand, collapses all features into a single column and uses an ID ("Name" in the example here) to keep track of which data point the feature value belongs to, e.g.

| Name | Feature    | Value |
| ---- | ---------- | ----- |
| Joe  | Age        | 41    |
| Carl | Age        | 32    |
| Mike | Age        | 22    |
| Sue  | Age        | 58    |
| Liz  | Age        | 27    |
| Joe  | Hair Color | Brown |
| Carl | Hair Color | Blond |
| Mike | Hair Color | Brown |
| Sue  | Hair Color | Black |
| Liz  | Hair Color | Blond |

Pandas lets us transform between these two formats.

In [182]:
df_wide = pd.DataFrame(
    data=[
        ["Joe", 41, "Brown", 55.7, 157], 
        ["Carl", 32, "Blond", 68.4, 177], 
        ["Mike", 22, "Brown", 44.4, 158], 
        ["Sue", 58, "Black", 82.2, 159], 
        ["Liz", 27, "Blond", 55.1, 169]], 
    columns=["Name", "Age", "Hair Color", "Weight", "Height"])
df_wide

   Name  Age Hair Color  Weight  Height
0   Joe   41      Brown    55.7     157
1  Carl   32      Blond    68.4     177
2  Mike   22      Brown    44.4     158
3   Sue   58      Black    82.2     159
4   Liz   27      Blond    55.1     169

# Melt -- convert wide dataframe --> tall dataframe

`melt(...)` transforms a wide-format dataframe into a tall format. The parameter `id_vars` takes a `single or tuple of column names` to be used as IDs. The remaining columns are treated as features and collapsed into (variable, value) pairs.

In [183]:
# Age, Hair Color, Weight and Height are implicitly assigned as value_vars
df_tall = df_wide.melt(id_vars="Name")
df_tall 
# id_vars perlukan column 'name' as ID

    Name    variable  value
0    Joe         Age     41
1   Carl         Age     32
2   Mike         Age     22
3    Sue         Age     58
4    Liz         Age     27
5    Joe  Hair Color  Brown
6   Carl  Hair Color  Blond
7   Mike  Hair Color  Brown
8    Sue  Hair Color  Black
9    Liz  Hair Color  Blond
10   Joe      Weight   55.7
11  Carl      Weight   68.4
12  Mike      Weight   44.4
13   Sue      Weight   82.2
14   Liz      Weight   55.1
15   Joe      Height    157
16  Carl      Height    177
17  Mike      Height    158
18   Sue      Height    159
19   Liz      Height    169

In [184]:
df_tall2 = df_wide.melt()
df_tall2 # stack semua table

      variable  value
0         Name    Joe
1         Name   Carl
2         Name   Mike
3         Name    Sue
4         Name    Liz
5          Age     41
6          Age     32
7          Age     22
8          Age     58
9          Age     27
10  Hair Color  Brown
11  Hair Color  Blond
12  Hair Color  Brown
13  Hair Color  Black
14  Hair Color  Blond
15      Weight   55.7
16      Weight   68.4
17      Weight   44.4
18      Weight   82.2
19      Weight   55.1
20      Height    157
21      Height    177
22      Height    158
23      Height    159
24      Height    169

# Pivot -- convert tall format to short format

Transforming a data frame from the tall to the wide format is called *pivoting*.

In [185]:
df_tall.pivot(index="Name", columns="variable", values="value")
# columns = apa column name nak letak utk wide format

variable Age Hair Color Height Weight
Name
Carl      32      Blond    177   68.4
Joe       41      Brown    157   55.7
Liz       27      Blond    169   55.1
Mike      22      Brown    158   44.4
Sue       58      Black    159   82.2

## Exploratory Data Analysis
A large part of our task as data scientists and analysts is to find patterns and interesting phenomena within data. We can make use of Pandas' vast assortment of functions to help us with this. The following exercises are designed to help you get an idea of the kind of questions you can answer with Pandas.

This dataset describes all olympic athletes, the year they participated, the event they participated in, and whether they received a medal. The data is split into two files, `olympics_events.csv` and `olympics_games.csv`, describing the events and metadata of the games, respectively. The data has been adjusted from https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results

### Exercise 1
1. Load the two files, `olympics_events.csv` and `olympics_games.csv`, and display the first 10 lines of each data frame.

In [ ]:
### Your code here

In [189]:
event = pd.read_csv('../data/olympics_events.csv')
games = pd.read_csv('../data/olympics_games.csv')
display(event.head())
display(games.head())

,Name,Sex,Age,Height,Weight,Nationality,Sport,Event,Medal,GamesID
0,A Dijiang,M,24.0,180.0,80.0,CHN,Basketball,Basketball Men's Basketball,NaN,37
1,A Lamusi,M,23.0,170.0,60.0,CHN,Judo,Judo Men's Extra-Lightweight,NaN,48
2,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,DEN,Football,Football Men's Football,NaN,6
3,Edgar Lindenau Aabye,M,34.0,NaN,NaN,DEN,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold,1
4,Christine Jacoba Aaftink,F,21.0,185.0,82.0,NED,Speed Skating,Speed Skating Women's 500 metres,NaN,36

   ID  Year  Season       City
0   0  1896  Summer     Athina
1   1  1900  Summer      Paris
2   2  1904  Summer  St. Louis
3   3  1906  Summer     Athina
4   4  1908  Summer     London

2. Merge the two data frames on the `GamesID` and `ID` columns. Drop the now-unnecessary id-columns afterwards.

In [197]:
event = event.merge(right = games, left_on = 'GamesID',right_on='ID',
                   how = 'outer')
display(event.head())

KeyError: 'GamesID'

In [194]:
event= event.drop(columns = ['GamesID','ID_x','ID_y','Year_y','Season_y','City_y'])
display(event.head()) # drop unnecessary columns sbb repeating

KeyError: "['GamesID', 'ID_x', 'ID_y', 'Year_y', 'Season_y', 'City_y'] not found in axis"

### Exercise 2
History lesson! Malaysia's olympic nationality code is `MAS`. Prior to this, the Federation of Malaya competed under the code `MAL`. Likewise, Sarawak and Sabah competed as North Borneo (`NBO`).

1. In which years did the Federation of Malaya compete in the Olympics?

In [ ]:
### Your code here

2. How many athletes did they send?

In [ ]:
### Your code here

In [200]:
len(event.loc[event["Nationality"] == "MAL"].unique())

AttributeError: 'DataFrame' object has no attribute 'unique'

In [ ]:
events.loc[events["Nationality"] == "MAL"].nunique()

3. Who were the first countries to participate in the Olympic games (as per this data set)?

In [ ]:
### Your code here

In [ ]:
earliest_year = events['Year'].min()
earliest_year

In [ ]:
first_event = events.loc[events["Year"] == earliest_year]
first_event

In [ ]:
countries = first_event["Nationality"].unique()
print(countries)

4. How many men and women has Malaysia (`MAS`) sent to the Olympics in total? Keep in mind that athletes can participate in multiple events and multiple years. Each person should only ever be counted once.

*HINT*: As we're only interested in athlete names and their genders, it's easiest to drop other columns and not have to worry about them. Create a new data frame but don't overwrite `events` as we'll need it for later exercises as well, though.

In [ ]:
### Your code here

### Exercise 3
1. How many men and women has Malaysia (`MAS`) sent to the Olympics each year?

    Hint: This is a lot like the previous question except that athletes only count as duplicate now if they compete in multiple events in the same year. An athlete competing in multiple years is no longer duplicate.

In [ ]:
### Your code here

2. How does the ratio of male to female athletes sent by Malaysia compare to the global ratio for the year 2016?

In [ ]:
### Your code here

### Exercise 4
Let's start looking at some of the numerical data!

1. How many gold medals has each country won? How about Malaysia (`MAS`)?

In [ ]:
### Your code here

#### Stacking and Unstacking Data Frames 
The previous solution is in an acceptable format, but it's not the most human-friendly way to present data. Instead, we can *unstack* our data and bring it into *wide* format.

In [ ]:
medal_table_wide = medal_table.unstack(fill_value=0)
medal_table_wide

The opposite operation, `*.stack()` brings it back into the original *long* format.

In [ ]:
medal_table_wide.stack()

### Exercise 5
1. What is the median age of gold medalists?

In [ ]:
### Your code here

2. What is the median age of gold, silver, and bronze medalists for each individual sport?

In [ ]:
### Your code here

3. Look at only swimmers. How has the mean weight of all competitors changed throughout the years? Use `*.plot()` to get a visual sense of the trend.

In [ ]:
### Your code here

4. What is the mean and standard deviation of the BMI of athletes in each sports discipline? The BMI can be computed as 

    $$BMI = Weight~/~\left(\frac{Height}{100}\right)^2$$

    with the values in this dataset. To solve this question, break it down into individual steps:
    - Calculate the BMI for all athletes
    - Group by 'Sport'
    - Calculate the mean and standard deviation of the BMI of the grouped data frame
    
    *Hint*: Use `*.agg([..., ...])` to apply "mean" and "std" (standard deviation) simultaneously.

In [ ]:
### Your code here

### Exercise 6
1. What country has the most gold medals in wrestling?

In [ ]:
### Your code here

2. How many different types of events have ever been held for fencing?

In [ ]:
### Your code here

3. Typically, only one of each medal is awarded per year for each event. This is not the case for team sports, however. If a team wins the gold, then each team member is awarded a gold medal. What is the largest team to have ever been awarded gold medals for a single event in a single year?

In [ ]:
### Your code here